app/views/quests/_form.html.erb

SELECT "npcs".* FROM "npcs" ORDER BY "npcs"."name" ASC
SELECT "npcs".* FROM "npcs" WHERE "npcs"."discovered" = ? ORDER BY "npcs"."name" ASC  [["discovered", "t"]]
---
  <% if admin? %>
    <%= form.collection_select :npc_id, Npc.order(:name), :id, :name, include_blank: true %>
  <% else %>
    <%= form.collection_select :npc_id, Npc.where(discovered: true).order(:name), :id, :name, include_blank: true %>