app/views/quests/_quest.html.erb

SELECT  1 AS one FROM "npcs" INNER JOIN "npcs_quests" ON "npcs"."id" = "npcs_quests"."npc_id" WHERE "npcs_quests"."quest_id" = ? LIMIT ?  [["quest_id", 13], ["LIMIT", 1]]
SELECT "npcs".* FROM "npcs" INNER JOIN "npcs_quests" ON "npcs"."id" = "npcs_quests"."npc_id" WHERE "npcs_quests"."quest_id" = ?  [["quest_id", 13]]
---

<% if not permitted(@quest.npcs).empty? %>