app/controllers/npcs_controller.rb

  def index
    @npcs = Npc.all
---
SELECT "npcs".* FROM "npcs"

  def show
    @npc = Npc.find(params[:id])
---
SELECT  "npcs".* FROM "npcs" WHERE "npcs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @npc = Npc.find(params[:id])
---
SELECT  "npcs".* FROM "npcs" WHERE "npcs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @npc = Npc.new(npc_params)

    if @npc.save
---
INSERT INTO "npcs" ("name", "description", "created_at", "updated_at", "discovered") VALUES (?, ?, ?, ?, ?)  [["name", "Seif der Meister"], ["description", ""], ["created_at", "2017-10-27 13:05:16.677126"], ["updated_at", "2017-10-27 13:05:16.677126"], ["discovered", "f"]]

  def update
    @Npc = Npc.find(params[:id])

    if @Npc.update(npc_params)
---
SELECT  "npcs".* FROM "npcs" WHERE "npcs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "npcs" SET "description" = ?, "updated_at" = ? WHERE "npcs"."id" = ?  [["description", "text"], ["updated_at", "2017-10-27 13:05:24.316362"], ["id", 4]]

  def destroy
    @Npc  = Npc.find(params[:id])
    @Npc.destroy
---
SELECT  "npcs".* FROM "npcs" WHERE "npcs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "npcs" WHERE "npcs"."id" = ?  [["id", 1]]