app/controllers/quests_controller.rb

  def index
    @quests = Quest.all
---
SELECT "quests".* FROM "quests"

  def show
    @quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @quest = Quest.new(quest_params)
    npc = Npc.find_by(id: params[:quest][:npc_id])
    @quest.npcs << npc unless !npc
---
INSERT INTO "quests" ("title", "description", "created_at", "updated_at", "discovered") VALUES (?, ?, ?, ?, ?)  [["title", "von player erstellt"], ["description", "text"], ["created_at", "2017-10-27 08:22:21.855345"], ["updated_at", "2017-10-27 08:22:21.855345"], ["discovered", "t"]]

  def update
    @quest = Quest.find(params[:id])
    npc = Npc.find_by(id: params[:quest][:npc_id])
    @quest.npcs << npc unless !npc

    if @quest.update(quest_params)
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "npcs".* FROM "npcs" WHERE "npcs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "npcs_quests" ("quest_id", "npc_id") VALUES (?, ?)  [["quest_id", 13], ["npc_id", 7]]
UPDATE "quests" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "quests"."id" = ?  [["title", "i forgot the old name"], ["description", "troll"], ["updated_at", "2017-10-24 14:59:35.764606"], ["id", 5]]

  def destroy
    @quest  = Quest.find(params[:id])
    @quest.destroy
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "npcs_quests" WHERE "npcs_quests"."quest_id" = ?  [["quest_id", 8]]
DELETE FROM "quests" WHERE "quests"."id" = ?  [["id", 6]]